13/data/attachments/4d3fdcfca98f2b35.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_23538b83-ec07-4fce-aea3-a1b54bbc0466</nif:username>
            <nif:friendToBeAdded>James_process_Friend_18200_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>